app/models/note.rb

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "hashtags".* FROM "hashtags" WHERE "hashtags"."tag_name" = ? LIMIT ?  [["tag_name", "無料"], ["LIMIT", 1]]
INSERT INTO "note_hashtags" ("note_id", "hashtag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["note_id", 5], ["hashtag_id", 4], ["created_at", "2019-08-12 20:04:45.927600"], ["updated_at", "2019-08-12 20:04:45.927600"]]
DELETE FROM "note_hashtags" WHERE "note_hashtags"."note_id" = ? AND 1=0  [["note_id", 4]]
---

  # NOTE: note投稿後の処理（DBへのコミット直前にハッシュタグ保存を実施する）
  after_create do
    note = Note.find_by(id: id)
    hashtags = overview.scan(/[#＃][\w\p{Han}ぁ-ヶｦ-ﾟー]+/)
    hashtags.uniq.map do |hashtag|
      # NOTE: ハッシュタグは先頭の'#'を外した上で保存
      tag = Hashtag.find_or_create_by(tag_name: hashtag.downcase.delete('#'))

SELECT "hashtags".* FROM "hashtags" INNER JOIN "note_hashtags" ON "hashtags"."id" = "note_hashtags"."hashtag_id" WHERE "note_hashtags"."note_id" = ?  [["note_id", 4]]
---
    note = Note.find_by(id: id)
    note.hashtags.clear
    hashtags = overview.scan(/[#＃][\w\p{Han}ぁ-ヶｦ-ﾟー]+/)
    hashtags.uniq.map do |hashtag|