app/models/user.rb

  def self.create_unique_string #ランダムにuid作成
---
INSERT INTO "users" ("email", "encrypted_password", "name", "provider", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def self.find_for_github_oauth(auth, signed_in_resource=nil)
    user = User.find_by(provider: auth.provider, uid: auth.uid)

    unless user
      user = User.new(provider: auth.provider,
                      uid:      auth.uid,
                      name:     auth.info.name,
                      email:    User.dummy_email(auth),
                      password: Devise.friendly_token[0, 20]
                      )
    end
    user.save
---
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? LIMIT ?  [["provider", "github"], ["uid", "51253545"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "name", "provider", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def total_notes#投稿Note数
    Note.where(user_id: id).count
---
SELECT COUNT(*) FROM "notes" WHERE "notes"."user_id" = ?  [["user_id", 1]]

  def total_reviews#総レビュー数
    notes = Note.where(user_id: id)
    total = 0
    notes.each do |note|
      total += Review.where(note_id: note.id).count
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."note_id" = ?  [["note_id", 1]]

  def average_quality#reviewのqualityの平均値
    notes = Note.where(user_id: id)
    average = 0
    notes.each do |note|
      average += Review.where(note_id: id).average(:quality).to_i#reviewがnilの場合は0にする
    end
    notes = Note.where(user_id: id).count
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ?  [["user_id", 1]]
SELECT AVG("reviews"."quality") FROM "reviews" WHERE "reviews"."note_id" = ?  [["note_id", 1]]
SELECT COUNT(*) FROM "notes" WHERE "notes"."user_id" = ?  [["user_id", 1]]

  def reply_rate#追記希望レビューへのリアクション率
    notes = Note.where(user_id: id)
    hope = 0
    reply = 0
    notes.each do |note|
      hope += Review.where(note_id: note.id).where(is_appending: '追記を希望する').count
      reply += Review.where(note_id: note.id).where(is_appending: '希望した追記にリアクション済み').count
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."note_id" = ? AND "reviews"."is_appending" = ?  [["note_id", 1], ["is_appending", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."note_id" = ? AND "reviews"."is_appending" = ?  [["note_id", 1], ["is_appending", 2]]