app/controllers/users/bookmarks_controller.rb

	def index
		@bookmarks = Bookmark.where(user_id: current_user.id)
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = ?  [["user_id", 1]]

	def create
		@bookmark = Bookmark.new(bookmark_params) #users/note/showから
		@bookmark.save
---
INSERT INTO "bookmarks" ("user_id", "note_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["note_id", 1], ["created_at", "2019-08-07 17:56:46.804644"], ["updated_at", "2019-08-07 17:56:46.804644"]]

	def destroy
		@bookmark = Bookmark.find(params[:id])
  		if @bookmark.destroy
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 1]]