app/controllers/users/my_notes_controller.rb

SELECT "my_notes".* FROM "my_notes" WHERE "my_notes"."user_id" = ?  [["user_id", 2]]
---
  def index
    @my_notes = MyNote.where(user_id: current_user.id).page(params[:page]).reverse_order

INSERT INTO "my_notes" ("user_id", "note_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["note_id", 7], ["created_at", "2019-08-12 20:45:13.067798"], ["updated_at", "2019-08-12 20:45:13.067798"]]
INSERT INTO "points" ("user_id", "reason", "point", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["reason", 0], ["point", 100], ["created_at", "2019-08-12 21:45:40.478193"], ["updated_at", "2019-08-12 21:45:40.478193"]]
INSERT INTO "my_notes" ("user_id", "note_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["note_id", 7], ["created_at", "2019-08-12 21:59:46.273475"], ["updated_at", "2019-08-12 21:59:46.273475"]]
UPDATE "users" SET "holding_point" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["holding_point", 920], ["updated_at", "2019-08-12 21:45:40.488119"], ["id", 2]]
---
  def create
    @my_note = MyNote.new(my_note_params)
    @my_note.user_id = current_user.id

    if current_user.holding_point >= @my_note.note.view_point
      if @my_note.save
        # 以下Pointテーブルに使用履歴を残すため
        @point = Point.new
        @point.point = @my_note.note.view_point
        @point.reason = 0
        @point.user_id = current_user.id
        @point.save
        # 保有ポイントから閲覧ポイント消費
        current_user.holding_point -= @point.point
        current_user.save