app/controllers/users/notes_controller.rb

SELECT  "notes".* FROM "notes" LIMIT ?  [["LIMIT", 11]]
---
	def index
		words = params[:q].delete(:search_words) if params[:q].present?	#params[:q]=nilだとエラー出るのでif #.deleteしないとwordsがシンボル？として扱われてsplitできない
		if words.present?
			params[:q][:groupings] = [] 								#配列の生成
		    words.split(/[ 　]/).each_with_index do |word, i|			#全角空白と半角空白で文字列を区切る。<=( /と/の間が区切る文字&[と]の間にある文字はどれか1つが選択される )
		    															#.each_with_indexで要素の数|i|だけブロック|word|を繰り返し実行
		    	params[:q][:groupings][i] = { title_or_overview_or_content_or_reviews_review_or_postscripts_postscript_cont: word }
		    end 														#検索範囲にかけて格納していく
		end
		@q = Note.ransack(params[:q])
		if params[:q].nil?												#何も検索していない時は@notes=nilとしてview側にも条件分岐記載して、notes.allが出ないようにする
			@notes = nil
		else
			@notes = @q.result.distinct.page(params[:page]).per(10).reverse_order	#distinctで一意性を持たせる

SELECT  1 AS one FROM "bookmarks" WHERE "bookmarks"."user_id" = ? AND "bookmarks"."note_id" = ? LIMIT ?  [["user_id", 1], ["note_id", 3], ["LIMIT", 1]]
SELECT  1 AS one FROM "my_notes" WHERE "my_notes"."user_id" = ? AND "my_notes"."note_id" = ? LIMIT ?  [["user_id", 2], ["note_id", 7], ["LIMIT", 1]]
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 11]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@note = Note.find(params[:id])
		if user_signed_in?
			if 	Bookmark.find_by(user_id: current_user.id, note_id: @note.id).present?
				@bookmark = Bookmark.find_by(user_id: current_user.id, note_id: @note.id)
			else
				@bookmark = Bookmark.new
			end
			if MyNote.find_by(user_id: current_user.id, note_id: @note_id).present?
				@my_note = MyNote.find_by(user_id: current_user.id, note_id: @note_id).present?
			else
				@my_note = MyNote.new
			end
			@review = Review.new
		else

		end
				@reviews = @note.reviews.page(params[:page]).reverse_order