app/controllers/users/notes_controller.rb

SELECT "notes".* FROM "notes" ORDER BY "notes"."id" DESC
---
	def index
		@notes = Note.all #一旦ALL、検索なしには表示しない

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = ?  [["user_id", 1]]
---
	def show
		@note = Note.find(params[:id])
		@bookmark = Bookmark.new
		@reviews = @note.reviews
		@review = Review.new
		#以下はブックマーク追加しいているかどうか判断で使用中
		@bookmarks = Bookmark.where(user_id: current_user.id)

INSERT INTO "notes" ("user_id", "title", "overview", "content", "is_browsable_guest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 2], ["title", "hjkl"], ["overview", "jkl"], ["content", "hjkl"], ["is_browsable_guest", 0], ["created_at", "2019-08-12 16:38:39.924600"], ["updated_at", "2019-08-12 16:38:39.924600"]]
---
	def create
		@note = Note.new(note_params)
		@note.user_id = current_user.id
		if @note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "notes" SET "overview" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["overview", "jklkk"], ["updated_at", "2019-08-12 16:42:33.420175"], ["id", 4]]
---
	def update
		@note = Note.find(params[:id])
		if @note.update(note_params)

SELECT  "hashtags".* FROM "hashtags" WHERE "hashtags"."tag_name" = ? LIMIT ?  [["tag_name", "hash1"], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" INNER JOIN "note_hashtags" ON "notes"."id" = "note_hashtags"."note_id" WHERE "note_hashtags"."hashtag_id" = ?  [["hashtag_id", 1]]
SELECT  "hashtags".* FROM "hashtags" WHERE "hashtags"."tag_name" = ? LIMIT ?  [["tag_name", "有料"], ["LIMIT", 1]]
---
	def hashtag
    	tag = Hashtag.find_by(tag_name: params[:tag_name])#選択したハッシュタグのtag_nameを取り出して
    	@notes = tag.notes.all#tag_nameに基づいたnoteを変数で渡す
    	@note = tag.notes.page(params[:page])