app/controllers/users/payments_controller.rb

UPDATE "users" SET "payjp_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["payjp_id", "cus_c30d60b2fe548f296612417bd569"], ["updated_at", "2019-08-15 16:02:01.115738"], ["id", 2]]
---
	def registration_payjp#カード入力によって得られたトークンで顧客作成（永続的にトークンを使用可能にする）
	    Payjp.api_key = "sk_test_a7ee466c4064bb2ae0bd4717"#秘密鍵
	   	response_customer = Payjp::Customer.create(card: params['payjp-token'])#トークンをもとに顧客を作成
	    current_user.payjp_id = response_customer.id#作成した顧客のidををuserテーブルのpayjp_id(string)としてDBに保存
	    current_user.save

INSERT INTO "points" ("user_id", "reason", "point", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["reason", 1], ["point", 100], ["created_at", "2019-08-15 16:05:05.972513"], ["updated_at", "2019-08-15 16:05:05.972513"]]
UPDATE "users" SET "holding_point" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["holding_point", 300], ["updated_at", "2019-08-15 16:05:05.983146"], ["id", 2]]
---
	def monthly_subscription#月額定期課金支払い
		if current_user.ppayjp_id.nil?		#カードが未登録の場合
			flash[:notice] = "カードを登録してください"
			redirect_to new_payment_path
		end

    	Payjp.api_key = "sk_test_a7ee466c4064bb2ae0bd4717"#秘密鍵
		Payjp::Subscription.create(				#pay.jpのsubscription(定期課金)にcustomerとplanを紐づける
    		customer: current_user.payjp_id,
    		plan:     @point.point,				#pay.jpのプランのIDを毎月の付与ポイントと一致させておくことで記述量が少なくなる＋確認しやすくなる
  		)
  		#Pointテーブルについての処理
  		@point = Point.new(point_params)	#viewからはPointのみhiddenで持ってくる
		@point.reason = 1					#月額付与分
		@point.user_id = current_user.id
		@point.save
		#Userテーブルの保有ポイントカラムについての処理
		current_user.holding_point += @point.point	#選択したplan(PointをUserの保有ポイントに追加)
		current_user.fee_category = @point.point
		current_user.save