app/controllers/users/points_controller.rb

INSERT INTO "points" ("user_id", "reason", "point", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["reason", 2], ["point", 100], ["created_at", "2019-08-16 04:11:02.315658"], ["updated_at", "2019-08-16 04:11:02.315658"]]
UPDATE "users" SET "holding_point" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["holding_point", 2720], ["updated_at", "2019-08-16 04:11:02.323697"], ["id", 2]]
---
      # reason2 =>追加購入
      @point.reason = 2
      @point.user_id = current_user.id
      @point.save
      # ユーザーの保有ポイントにも反映させる
      current_user.holding_point += @point.point
      current_user.save