app/controllers/users/points_controller.rb

	def index
		@points = Point.where(user_id: current_user.id).order(id: "DESC")
---
SELECT "points".* FROM "points" WHERE "points"."user_id" = ? ORDER BY "points"."id" DESC  [["user_id", 2]]

	def create
		@point = Point.new(point_params)
		@point.reason = 2
		@point.user_id = current_user.id
		@point.save
		current_user.holding_point += @point.point
		current_user.save
---
INSERT INTO "points" ("user_id", "reason", "point", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["reason", 2], ["point", 100], ["created_at", "2019-08-12 17:52:28.334645"], ["updated_at", "2019-08-12 17:52:28.334645"]]
INSERT INTO "points" ("user_id", "reason", "point", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["reason", 2], ["point", 100], ["created_at", "2019-08-12 18:00:44.813168"], ["updated_at", "2019-08-12 18:00:44.813168"]]
UPDATE "users" SET "holding_point" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["holding_point", 560], ["updated_at", "2019-08-12 19:01:38.316623"], ["id", 2]]