app/controllers/users/postscripts_controller.rb

INSERT INTO "postscripts" ("review_id", "note_id", "postscript", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["review_id", 1], ["note_id", 1], ["postscript", "postscript-test"], ["created_at", "2019-08-11 07:01:26.586005"], ["updated_at", "2019-08-11 07:01:26.586005"]]
UPDATE "reviews" SET "is_appending" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["is_appending", 2], ["updated_at", "2019-08-11 08:17:05.751295"], ["id", 1]]
---
  def create
    @postscript = Postscript.new(postscript_params)
    if @postscript.save
      @review = @postscript.review
      @review.is_appending = 2
      @review.save