app/controllers/users/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    if @review.save
---
INSERT INTO "reviews" ("user_id", "note_id", "quality", "review", "is_appending", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["note_id", 1], ["quality", 2.0], ["review", "test-appending2"], ["is_appending", 1], ["created_at", "2019-08-09 23:13:27.542556"], ["updated_at", "2019-08-09 23:13:27.542556"]]