app/controllers/users/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "notes" WHERE "notes"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @notes = Note.where(user_id: @user).page(params[:page]).reverse_order

UPDATE "users" SET "payjp_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["payjp_id", "cus_a2a464064667c7d7f9dac3904ce7"], ["updated_at", "2019-08-15 12:56:04.812842"], ["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
      # NOTE: 無料会員から有料会員へ変更すると月額料金申し込みページへ遷移
      if @user.is_member == '有料会員' && Subscription.where(user_id: @user.id).empty?
        # HACK: 現状は遷移先で種別を選んだらis_member == '有料会員'にしてsave
        # TODO: 遷移先で「まだ有料会員に変更処理は終わっていません」等の表示による対応＋プラン選択後に正常に処理が終わった旨通知等
        @user.is_member = '無料会員'
        @user.update(user_params)
        flash[:notice] = '編集しました。有料会員なので、プランを選んでください。'
        redirect_to subscriptions_path
        # NOTE: 有料会員から無料会員に変更すると定期課金情報削除
      elsif @user.is_member == '無料会員' && Subscription.where(user_id: @user.id).exists?