app/views/users/notes/show.html.erb


		<!--投稿者の確認-->
		<% if @note.user != current_user %><!--通常処理(閲覧中のNoteが他人の投稿である場合)-->
			<%= form_for(@bookmark) do |f| %>
				<%= f.hidden_field :note_id, value: @note.id %>
				<%= f.hidden_field :user_id, value: current_user.id %>
				<%= f.submit "Bookmarkに追加" %>
			<% end %>
			<!--ユーザーがブックマーク追加済みか否かの判断-->
			<!--書き方センスない、他を探す＋これだと追加済の場合の処理（追加済の告知＆bookmark削除）ができない、コントローラーも修正-->
			<% @bookmarks.each do |bookmark| %>
			<% if @note == bookmark.note %><!--通常処理（ブックマーク追加しているNoteの場合 => スルー)-->
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]